In [1]:
import numpy as np

In [2]:
import pandas as pd

In [7]:
p = {'item':['apple','apple','orange','orange','guns','guns'], 'days': ['mon','tue','wed','thur','fri','sat'], 'sales': [100,80,500,300,8,47]}

In [8]:
p

{'item': ['apple', 'apple', 'orange', 'orange', 'guns', 'guns'],
 'days': ['mon', 'tue', 'wed', 'thur', 'fri', 'sat'],
 'sales': [100, 80, 500, 300, 8, 47]}

In [9]:
df = pd.DataFrame(p)

In [10]:
df

     item  days  sales
0   apple   mon    100
1   apple   tue     80
2  orange   wed    500
3  orange  thur    300
4    guns   fri      8
5    guns   sat     47

In [11]:
df.groupby(items)

NameError: name 'items' is not defined

In [12]:
x = df.groupby('item')

In [13]:
x.mean()

        sales
item
apple    90.0
guns     27.5
orange  400.0

In [14]:
x.sum()

        sales
item
apple     180
guns       55
orange    800

In [15]:
x.count()

        days  sales
item
apple      2      2
guns       2      2
orange     2      2

In [16]:
x.max()

       days  sales
item
apple   tue    100
guns    sat     47
orange  wed    500

In [17]:
x.min()

        days  sales
item
apple    mon     80
guns     fri      8
orange  thur    300

In [18]:
x.describe()

       sales
       count   mean         std    min     25%    50%     75%    max
item
apple    2.0   90.0   14.142136   80.0   85.00   90.0   95.00  100.0
guns     2.0   27.5   27.577164    8.0   17.75   27.5   37.25   47.0
orange   2.0  400.0  141.421356  300.0  350.00  400.0  450.00  500.0

In [19]:
x.describe().transpose()

item              apple       guns      orange
sales count    2.000000   2.000000    2.000000
      mean    90.000000  27.500000  400.000000
      std     14.142136  27.577164  141.421356
      min     80.000000   8.000000  300.000000
      25%     85.000000  17.750000  350.000000
      50%     90.000000  27.500000  400.000000
      75%     95.000000  37.250000  450.000000
      max    100.000000  47.000000  500.000000